Repository: gmag11/Paperless_ngx_uploader
Catalog: lib/l10n/app_*.arb
Languages: es

# action_select_none
source: Select none
es: Borrar todo

# connectionSuccess
source: Connection successful
es: Conexión correcta

# dialog_title_paperless_configuration
source: Paperless-NGX Configuration
es: Configuración de Paperless-NGX

# field_label_server_url
source: Server URL
es: URL del servidor

# field_hint_server_url_example
source: https://paperless.example.com
es: https://paperless.ejemplo.com

# validation_enter_server_url
source: Please enter server URL
es: Por favor, introduce la URL del servidor

# validation_enter_valid_url
source: Please enter a valid URL
es: Por favor, introduce una URL válida

# field_label_username
source: Username
es: Usuario

# validation_enter_username
source: Please enter username
es: Por favor, introduce el usuario

# field_label_password
source: Password
es: Contraseña

# validation_enter_password
source: Please enter password
es: Por favor, introduce la contraseña

# action_cancel
source: Cancel
es: Cancelar

# action_save_and_test
source: Save & Test
es: Guardar y Probar

# tag_dialog_title_select_tags
source: Select Tags
es: Seleccionar etiquetas

# action_retry
source: Retry
es: Reintentar

# action_apply
source: Apply
es: Aplicar

# search_label_search_tags
source: Search tags
es: Buscar etiquetas

# action_select_default_tags
source: Select Default Tags
es: Seleccionar etiquetas por defecto

# snackbar_received_file_prefix
source: File: {fileName}
es: Archivo: {fileName}

# snackbar_file_uploaded
source: File uploaded
es: Archivo subido

# snackbar_all_files_uploaded
source: All {count} files uploaded successfully
es: Todos los {count} archivos se subieron correctamente

# snackbar_upload_error_prefix
source: Upload error: {error}
es: Error de subida: {error}

# snackbar_multiple_uploads_failed
source: {failed} of {total} files failed to upload
es: {failed} de {total} archivos fallaron al subir

# welcome_title
source: Welcome to Paperless-NGX Uploader
es: Bienvenido a Paperless-NGX Uploader

# welcome_subtitle
source: Configure your Paperless-NGX server to start uploading documents
es: Configura tu servidor Paperless‑NGX para comenzar a subir documentos

# welcome_action_configure_server
source: Configure Server
es: Configurar servidor

# banner_type_warning
source: File type {mimeType} may not be supported. Upload will be attempted anyway.
es: El tipo de archivo {mimeType} puede no estar soportado. Se intentará la subida igualmente.

# panel_title_uploading_document
source: Uploading document
es: Subiendo documento

# section_title_server_configuration
source: Paperless-ngx server
es: Servidor Paperless-ngx

# server_not_configured
source: Not configured
es: Sin configurar

# section_title_tag_configuration
source: Tag Configuration
es: Configuración de etiquetas

# tooltip_edit_tags
source: Edit tags
es: Editar etiquetas

# empty_tags_title
source: No tags selected
es: No hay etiquetas seleccionadas

# empty_tags_subtitle
source: Tap "Select Tags" to configure
es: Pulsa "Seleccionar etiquetas" para configurar

# tags_configured_count
source: {count} tag{pluralSuffix} configured
es: {count} etiqueta{pluralSuffix} configurada{pluralSuffix}

# howto_title
source: How to use:
es: Cómo usar:

# howto_step_1
source: 1. Share a document from any app
es: 1. Comparte un documento desde cualquier app

# howto_step_2
source: 2. Select "Paperless-NGX Uploader"
es: 2. Selecciona "Paperless-NGX Uploader"

# howto_step_3
source: 3. Upload will happen immediately
es: 3. La subida se realizará inmediatamente

# snackbar_configure_server_first
source: Please configure server connection first
es: Por favor, configura primero la conexión con el servidor

# error_auth_failed
source: Authentication failed. Check username and password.
es: Autenticación fallida. Revisa el usuario y la contraseña.

# error_file_too_large
source: The file is too large for the server.
es: El archivo es demasiado grande para el servidor.

# error_unsupported_type
source: File type not supported by the server.
es: Tipo de archivo no soportado por el servidor.

# error_server
source: Server error. Try again later.
es: Error del servidor. Inténtalo de nuevo más tarde.

# error_network
source: Network error. Check your connection.
es: Error de red. Revisa tu conexión.

# error_file_read
source: Error reading the local file.
es: Error al leer el archivo local.

# error_invalid_response
source: Invalid server response.
es: Respuesta del servidor no válida.

# field_label_auth_method
source: Authentication Method
es: Método de autenticación

# field_option_auth_user_pass
source: Username / Password
es: Usuario / Contraseña

# field_option_auth_token
source: API Token
es: Token API

# field_label_api_token
source: API Token
es: Token API

# validation_enter_token
source: Please enter API token
es: Por favor, introduce el token API

# error_invalid_token
source: Invalid token
es: Token no válido

# error_invalid_credentials
source: Invalid username or password
es: Usuario o contraseña no válidos

# error_server_unreachable
source: Server is unreachable
es: El servidor no está accesible

# error_invalid_server
source: Invalid server URL or not a Paperless-NGX server
es: URL de servidor no válida o no es un servidor Paperless-NGX

# error_ssl
source: SSL certificate error
es: Error de certificado SSL

# error_unknown
source: Unknown connection error occurred
es: Se ha producido un error de conexión desconocido

# update_available_title
source: Update Available
es: Actualización disponible

# update_available_message
source: A new version {version} is available. Would you like to download it?
es: Una nueva versión {version} está disponible. ¿Te gustaría descargarla?

# action_download
source: Download
es: Descargar

# action_later
source: Later
es: Más tarde

# permission_required_title
source: Storage Permissions Required
es: Permisos de almacenamiento requeridos

# permission_required_message
source: This app needs storage permissions to access files for upload. Please grant the permissions in app settings.
es: Esta aplicación necesita permisos de almacenamiento para acceder a los archivos para subir. Por favor, concede los permisos en la configuración de la aplicación.

# action_open_settings
source: Open Settings
es: Abrir configuración

# error_permission_denied
source: Storage permissions denied. Cannot access files for upload.
es: Permisos de almacenamiento denegados. No se pueden acceder a los archivos para subir.
